TcMenu/tcLibraryDev/experimental/stm32f429zi/stm32_discovery.c
  /* Check the communication status */
  if(status != HAL_OK)
  {
    /* Re-Initialize the BUS */
    I2Cx_Error();
  }

  return status;
}

/**
  * @brief  Reads multiple data on the BUS in using DMA mode.
  * @param  Addr: I2C Address
  * @param  Reg: Reg Address
  * @param  pBuffer: pointer to read data buffer
  * @param  Length: length of the data
  * @retval HAL status
  */
static HAL_StatusTypeDef I2Cx_ReadBufferDMA(uint8_t Addr, uint16_t Reg, uint8_t *pBuffer, uint16_t Length)
{
  HAL_StatusTypeDef status = HAL_OK;

  status = HAL_I2C_Mem_Read_DMA(&I2cHandle, Addr, Reg, I2C_MEMADD_SIZE_16BIT, pBuffer, Length);

  /* Check the communication status */
  if(status != HAL_OK)
  {
    /* Re-Initialize the BUS */
    I2Cx_Error();
  }

  return status;
}

/**
* @brief  Checks if target device is ready for communication.
* @note   This function is used with Memory devices
* @param  DevAddress: Target device address
* @param  Trials: Number of trials
* @retval HAL status
*/
static HAL_StatusTypeDef I2Cx_IsDeviceReady(uint16_t DevAddress, uint32_t Trials)
{
  return (HAL_I2C_IsDeviceReady(&I2cHandle, DevAddress, Trials, I2cxTimeout));
}
#endif /* EE_M24LR64 */

/**
  * @brief  I2Cx error treatment function
  */
static void I2Cx_Error(void)
{
    /* De-initialize the SPI communication BUS */
    HAL_I2C_DeInit(&I2cHandle);

    /* Re-Initialize the SPI communication BUS */
    I2Cx_Init();
}

/******************************* SPI Routines *********************************/

/**
  * @brief  SPIx Bus initialization
  */
static void SPIx_Init(void)
{
    if(HAL_SPI_GetState(&SpiHandle) == HAL_SPI_STATE_RESET)
    {
        /* SPI configuration -----------------------------------------------------*/
        SpiHandle.Instance = DISCOVERY_SPIx;
        /* SPI baudrate is set to 5.6 MHz (PCLK2/SPI_BaudRatePrescaler = 90/16 = 5.625 MHz)
           to verify these constraints:
           - ILI9341 LCD SPI interface max baudrate is 10MHz for write and 6.66MHz for read
           - l3gd20 SPI interface max baudrate is 10MHz for write/read
           - PCLK2 frequency is set to 90 MHz
        */
        SpiHandle.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;

        /* On STM32F429I-Discovery, LCD ID cannot be read then keep a common configuration */
        /* for LCD and GYRO (SPI_DIRECTION_2LINES) */
        /* Note: To read a register a LCD, SPI_DIRECTION_1LINE should be set */
        SpiHandle.Init.Direction      = SPI_DIRECTION_2LINES;
        SpiHandle.Init.CLKPhase       = SPI_PHASE_1EDGE;
        SpiHandle.Init.CLKPolarity    = SPI_POLARITY_LOW;
        SpiHandle.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLED;
        SpiHandle.Init.CRCPolynomial  = 7;
        SpiHandle.Init.DataSize       = SPI_DATASIZE_8BIT;
        SpiHandle.Init.FirstBit       = SPI_FIRSTBIT_MSB;
        SpiHandle.Init.NSS            = SPI_NSS_SOFT;
        SpiHandle.Init.TIMode         = SPI_TIMODE_DISABLED;
        SpiHandle.Init.Mode           = SPI_MODE_MASTER;

        SPIx_MspInit(&SpiHandle);
        HAL_SPI_Init(&SpiHandle);
    }
}

/**
  * @brief  Reads 4 bytes from device.
  * @param  ReadSize: Number of bytes to read (max 4 bytes)
  * @retval Value read on the SPI
  */
static uint32_t SPIx_Read(uint8_t ReadSize)
{
    HAL_StatusTypeDef status = HAL_OK;
    uint32_t readvalue;

    status = HAL_SPI_Receive(&SpiHandle, (uint8_t*) &readvalue, ReadSize, SpixTimeout);

    /* Check the communication status */
    if(status != HAL_OK)
    {
        /* Re-Initialize the BUS */
        SPIx_Error();
    }

    return readvalue;
}

/**
  * @brief  Writes a byte to device.
  * @param  Value: value to be written
  */
static void SPIx_Write(uint16_t Value)
{
    HAL_StatusTypeDef status = HAL_OK;

    status = HAL_SPI_Transmit(&SpiHandle, (uint8_t*) &Value, 1, SpixTimeout);

    /* Check the communication status */
    if(status != HAL_OK)
    {
        /* Re-Initialize the BUS */
        SPIx_Error();
    }
}

/**
  * @brief  Sends a Byte through the SPI interface and return the Byte received
  *         from the SPI bus.
  * @param  Byte: Byte send.
  * @retval The received byte value
  */
static uint8_t SPIx_WriteRead(uint8_t Byte)
{
    uint8_t receivedbyte = 0;

    /* Send a Byte through the SPI peripheral */
    /* Read byte from the SPI bus */
    if(HAL_SPI_TransmitReceive(&SpiHandle, (uint8_t*) &Byte, (uint8_t*) &receivedbyte, 1, SpixTimeout) != HAL_OK)
    {
        SPIx_Error();
    }

    return receivedbyte;
}

/**
  * @brief  SPIx error treatment function.
  */
static void SPIx_Error(void)
{
    /* De-initialize the SPI communication BUS */
    HAL_SPI_DeInit(&SpiHandle);

    /* Re- Initialize the SPI communication BUS */
    SPIx_Init();
}

/**
  * @brief  SPI MSP Init.
  * @param  hspi: SPI handle
  */
static void SPIx_MspInit(SPI_HandleTypeDef *hspi)
{
    GPIO_InitTypeDef   GPIO_InitStructure;

    /* Enable SPIx clock */
    DISCOVERY_SPIx_CLK_ENABLE();

    /* Enable DISCOVERY_SPI GPIO clock */
    DISCOVERY_SPIx_GPIO_CLK_ENABLE();

    /* configure SPI SCK, MOSI and MISO */
    GPIO_InitStructure.Pin    = (DISCOVERY_SPIx_SCK_PIN | DISCOVERY_SPIx_MOSI_PIN | DISCOVERY_SPIx_MISO_PIN);
    GPIO_InitStructure.Mode   = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull   = GPIO_PULLDOWN;
    GPIO_InitStructure.Speed  = GPIO_SPEED_MEDIUM;
    GPIO_InitStructure.Alternate = DISCOVERY_SPIx_AF;
    HAL_GPIO_Init(DISCOVERY_SPIx_GPIO_PORT, &GPIO_InitStructure);
}

/********************************* LINK LCD ***********************************/

/**
  * @brief  Configures the LCD_SPI interface.
  */
void LCD_IO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    if(Is_LCD_IO_Initialized == 0)
    {
        Is_LCD_IO_Initialized = 1;

        /* Configure NCS in Output Push-Pull mode */
        LCD_WRX_GPIO_CLK_ENABLE();
        GPIO_InitStructure.Pin     = LCD_WRX_PIN;
        GPIO_InitStructure.Mode    = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStructure.Pull    = GPIO_NOPULL;
        GPIO_InitStructure.Speed   = GPIO_SPEED_FAST;
        HAL_GPIO_Init(LCD_WRX_GPIO_PORT, &GPIO_InitStructure);

        LCD_RDX_GPIO_CLK_ENABLE();
        GPIO_InitStructure.Pin     = LCD_RDX_PIN;
        GPIO_InitStructure.Mode    = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStructure.Pull    = GPIO_NOPULL;
        GPIO_InitStructure.Speed   = GPIO_SPEED_FAST;
        HAL_GPIO_Init(LCD_RDX_GPIO_PORT, &GPIO_InitStructure);

        /* Configure the LCD Control pins ----------------------------------------*/
        LCD_NCS_GPIO_CLK_ENABLE();

        /* Configure NCS in Output Push-Pull mode */
        GPIO_InitStructure.Pin     = LCD_NCS_PIN;
        GPIO_InitStructure.Mode    = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStructure.Pull    = GPIO_NOPULL;
        GPIO_InitStructure.Speed   = GPIO_SPEED_FAST;
        HAL_GPIO_Init(LCD_NCS_GPIO_PORT, &GPIO_InitStructure);

        /* Set or Reset the control line */
        LCD_CS_LOW();
        LCD_CS_HIGH();

        SPIx_Init();
    }
}

/**
  * @brief  Writes register value.
  */
void LCD_IO_WriteData(uint16_t RegValue)
{
    /* Set WRX to send data */
    LCD_WRX_HIGH();

    /* Reset LCD control line(/CS) and Send data */
    LCD_CS_LOW();
    SPIx_Write(RegValue);

    /* Deselect: Chip Select high */
    LCD_CS_HIGH();
}

/**
  * @brief  Writes register address.
  */
void LCD_IO_WriteReg(uint8_t Reg)
{
    /* Reset WRX to send command */
    LCD_WRX_LOW();

